#+TITLE: The Morning Routine
#+AUTHOR: Demo Author
#+DATE: 2025-01-15
#+LANGUAGE: en
#+STARTUP: overview
#+TODO: TODO(t) TOWRITE(h) TOREVIEW(j@/!) REDO(k@/!) RESTRUCTURE(n@/!) | FINISHED(l!) PURGE(ñ@/!)
#+COLUMNS: %40ITEM(Task) %12WORDCOUNT %12PoV %30Characters %20Plot %40Summary %40Comment
#+MACRO: scene-break SCENE-BREAK

* stats :ignore:noexport:
:PROPERTIES:
:WORDCOUNT: 0
:ID:       12629909-9619-4ea6-bcf6-ab6c437ecd32
:END:
# This shows your word count by sections:
# Table to keep track of the words by section
#+BEGIN: org-generate-wordcount-table
| Heading                               | Wordcount |
|---------------------------------------+-----------|
| - [[Act I]]                               |       711 |
| -- [[Chapter 1]]                          |       447 |
| --- [[Scene 1 - The Alarm]]               |       167 |
| --- [[Scene 2 - Coffee Shop Encounter]]   |       280 |
| -- [[Chapter 2]]                          |       264 |
| --- [[Scene 1 - The Decision]]            |       264 |
| - [[Act II]]                              |       277 |
| -- [[Chapter 3]]                          |       269 |
| --- [[Scene 1 - First Attempt]]           |       269 |
| -- [[Chapter 4 - Learning and Adjusting]] |         8 |
| --- [[Scene 1 - Coffee Talk]]             |         4 |
| --- [[Scene 2 - Finding Balance]]         |         4 |
| - [[Act III]]                             |       308 |
| -- [[Chapter 5 - The New Normal]]         |       308 |
| --- [[Scene 1 - Full Circle]]             |       308 |

#+END:

# If you want to track here a daily word count, you can use the
# =org-tracktable-insert-table= command with an empty line at point.
# For more details, check the [[https://codeberg.org/jcastp/org-tracktable/src/branch/main/README.org][org-tracktable documentation]] at
# https://codeberg.org/jcastp/org-tracktable/src/branch/main/README.org
#+NAME: tracktable
|---+---------------+-------+------+---------------+------------|
| * |          date | start |  end | total (today) | comment    |
|---+---------------+-------+------+---------------+------------|
|   | initial count |     0 |    0 |             0 |            |
|   |    2025-01-15 |     0 |  892 |           892 | First day  |
|   |    2025-01-16 |   892 | 1654 |           762 | Good flow  |
|   |    2025-01-17 |  1654 | 2847 |          1193 | Finished 3 |
|---+---------------+-------+------+---------------+------------|
#+TBLFM: @2$2=initial count::$2='(org-tracktable-stamp)::@2$3=0::$3=(@-1$4)::$4='(org-tracktable-current-count)::$5=$4-$3

